'''
    Задание 4. Напишите программу -- доработку программы из задания 3, которая выведет сообщение об ошибке,
    если хотябы одна из двух дат является некорректной. Например 29/02/2017.
'''
date_1_day = int(input("date_1_day: "))
date_1_month = int(input("date_1_month"))
date_1_year = int(input("date_1_year: "))

date_2_day = int(input("date_2_day: "))
date_2_month = int(input("date_2_month: "))
date_2_year = int(input("date_2_year: "))

answer = "I don't know"

################## Начало Вашего Кода #######################


################## Конец Вашего Кода ########################

print(answer)