'''
    Задание 2: Вывод текста с помощью print

    Дан список информации о человеке: [Фамилия, Имя, день рождения, месяц рождения, год рождения, Пол(М/Ж)]

    С помощью print вывести текст про человека, сохраненного в переменную person.

    "<Имя> <Фамилия> является [мужчиной|женщиной] <Год> г. рождения. Возраст: <X>"

    возраст необходимо посчитать, используя переменную today.

    Например, если person примет значения person_1, необходимо вывести:

    "Андрей Попов является мужчиной 1999 г. рождения. Возраст: 24"

    А если person_2:
    
    "Дарина Романова является женщиной 1970 г. рождения. Возраст: 54"

'''

person_1 = ['Андрей', 'Попов', 31, 10, 1999, 'М'],
person_2 = ['Дарина', 'Романова', 29, 2, 1970, 'Ж'],
today = [21, 8, 2024]

person = person_1  # Можно поменять на person_2

######################################################################
######################## Your code starts here #######################




############################ Your Code Ends Here #####################
######################################################################
