'''
    Задание 5. Дан список списков, представляющий собой таблицу, 
    где каждая строка хранит информацию о человеке.
    С помощью функции print() необходимо вывести каждого человека 
    из таблицы на экран в формате как в задании 2.

    Например, первый элемент списка необходимо вывести следуюшим образом:
    "Андрей Попов является мужчиной 1999 г. рождения. Возраст: 24"
    
    А последний следующим:
    "Дарина Романова является женщиной 1970 г. рождения. Возраст: 54"

    Можно использовать данную переменную today
'''

person_table = [
    ['Андрей', 'Попов', 31, 10, 1999, 'М'],
    ['Дарина', 'Романова', 29, 2, 1900, 'Ж'],
    ['Василий', 'Зайцев', 12, 4, 1992, 'M'],
    ['Елена', 'Синицина', 8, 2, 2000, 'Ж'],
    ['Степан', 'Семечкин', 32, 11, 2922, 'M'],
]

today = [30, 8, 2024]


################## Начало Вашего Кода #######################
################## Конец Вашего Кода ########################