'''
    Задание 3: Пользователь вводит день, месяц и год двух дат, которые сохранены в шесть переменных.
    Напишите код, который сравнит две даты и выведет "Первая дата раньше", если первая дата обозначает более ранний день.
    Если же вторая дата случилась позже, выведите сообщение "Первая дата позже".
'''
date_1_day = int(input("date_1_day: "))
date_1_month = int(input("date_1_month"))
date_1_year = int(input("date_1_year: "))

date_2_day = int(input("date_2_day: "))
date_2_month = int(input("date_2_month: "))
date_2_year = int(input("date_2_year: "))

answer = "I don't know"

################## Начало Вашего Кода #######################


################## Конец Вашего Кода ########################

print(answer)