'''
    Задание 6. Дан список списков, представляющий собой таблицу, 
    где каждая строка хранит информацию о человеке.
    С помощью функции print() необходимо вывести каждого человека **с правильной датой рождения** 
    из таблицы на экран в формате как в задании 2.

    Людей с неправильной датой рождения можно проигнорировать и пропустить
    или же написать сообщение об ошибке.

    Можно использовать данную переменную today
'''

person_table = [
    ['Андрей', 'Попов', 31, 10, 1999, 'М'],
    ['Дарина', 'Романова', 29, 2, 1900, 'Ж'],
    ['Василий', 'Зайцев', 12, 4, 1992, 'M'],
    ['Николай', 'Медведев', 29, 2, 2017, 'M'],
    ['Елена', 'Синицина', 8, 2, 2000, 'Ж'],
    ['Степан', 'Семечкин', 32, 11, 2922, 'M'],
]

today = [30, 8, 2024]


################## Начало Вашего Кода #######################
################## Конец Вашего Кода ########################