'''
(16): Метеорологическая служба вела наблюдение за погодой в течение нескольких дней.
Напишите программу, которая определяет максимальную четную температуру 
и минимальную нечетную температуру за время наблюдения и выводит «Yes»,
если температура опускалась ниже 0 градусов и выводит «No» в противном случае. 
В программе обязательно есть хотя бы одна четная и одна нечетная температура.
На вход программы подается количество дней наблюдения, 
а затем температуры воздуха за каждый день — целые числа. 

Программа должна вывести 2 числа — максимальную четную температуру 
и минимальную нечетную температуру за время наблюдения, а также вывести «Yes» или «No». 

Пример работы программы:

1) Входные данные
-------------------------------
5
-20
15
8
7
9
-------------------------------
Выходные данные
-------------------------------
8
7
Yes

2) Входные данные
-------------------------------
5
11
9
2
6
3
-------------------------------
Выходные данные
-------------------------------
6
3
No

'''

# Напишите ваш код здесь