'''
    Задание: Реализация LinkedList

    Необходимо реализовать класс LinkedList, который хранит последовательность чисел.

    Класс должен поддерживать следующие методы:

        size() — возвращает количество элементов, находящихся в списке.

        get(i) — возвращает элемент, находящийся на позиции i. Индексация начинается с 0.

        push_back(elem) -- добавляет элемент elem в конец списка.

        push_front(elem) -- добавляет элемент elem в начало списка.

        remove_back() -- удаляет последний элемент списка и возвращает его значение.

        remove_front() -- удаляет первый элемент списка и возвращает его значение.

        insert(i, elem) -- вставляет элемент elem на позицию i. Существующие элементы после этой позиции сдвигаются на одну позицию вправо.

    Пример

    Если список содержит:
    [10, 20, 30]


    то:

        ll.get(1)
        # 20

        ll.push_back(40)
        # [10, 20, 30, 40]

        ll.push_front(5)
        # [5, 10, 20, 30, 40]

        ll.insert(2, 15)
        # [5, 10, 15, 20, 30, 40]

        ll.remove_front()
        # возвращает 5
        # [10, 15, 20, 30, 40]

        ll.remove_back()
        # возвращает 40
        # [10, 15, 20, 30]

        ll.size()
        # 4

    Требования:
    
    Необходимо корректно обрабатывать:
        - пустой список;
        - список из одного элемента;
        - добавление элементов в начало и конец;
        - удаление элементов из начала и конца;
        - вставку элемента в начало, середину и конец;
        - корректное изменение размера списка после каждой операции;
        - некорректные индексы.
'''
class LinkedList:
    pass
